1) Создайте текстовый массив с названиями цифр от 0 до 9. Пользователь вводит число и получает на экран его название.
------------------------------------------------------------------------------------------------------------------------

#include <iostream>
using namespace std;
 
int main()
{
 
 string str[10] = { "нуль","один","два","три","четыре","пять","шесть","семь","восемь","девять" };
    int i;
    cin >> i;
    cout << str[i] << endl;
 
 return 0;
}
----------------------
2) Пользователь вводит строку. Используя указатель на строку, сдвиньте каждую букву в строке на 1 (a → b, b→c …) (каждый символ задается числом) длину строки можно получить функцией strlen() из библиотеки cstring.
---------------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <cstring>
using namespace std;
 
int main()
{
    char K[100];
    cin>>K;
   
 char * L;
 L=K;
 int l=strlen(K);
 
 for(int i=0;i<=l-1;i++){
     int asc=(int)*(L+i);
     if(asc==122){
         asc=asc-25;
     }
     else{
         asc=asc+1;
     }
     cout<<(char)asc;
 }
}
 ---------------------------------------------------------------------------------------------------------------
